Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkSymbolAttributes Class
 The ViewMarkSymbolAttributes class contains symbol attributes for view mark tags.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.ViewMarkBasicSymbolAttributes
 Tekla.Structures.Drawing.View.ViewMarkSymbolAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ViewMarkSymbolAttributes : ViewMarkBasicSymbolAttributes
<SerializableAttribute>
Public NotInheritable Class ViewMarkSymbolAttributes
	Inherits ViewMarkBasicSymbolAttributes
The View.ViewMarkSymbolAttributes type exposes the following members.
Constructors
Name | Description
View.ViewMarkSymbolAttributes()
 Creates a new mark symbol attributes instance.
View.ViewMarkSymbolAttributes(Double, MarkSymbolShape, View.LabelLineLengthType, Double)
 Creates a new mark symbol attributes instance with the given size, shape, line length type and line length.
Top
Properties
Name | Description
LineLength
 The label line length in the case of custom length.
LineLengthType
 The label line length type.
Shape
 The shape of the mark symbol.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Size
 The size of the mark symbol.
 (Inherited from ViewMarkBasicSymbolAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewMarkBasicSymbolAttributes.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace